Revit 2026 API

# ColumnAttachmentSetJustification Method

---

Setter of ColumnAttachmentJustification

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetJustification(
	ColumnAttachmentJustification justification
)
```
```vb
Public Sub SetJustification (
	justification As ColumnAttachmentJustification
)
```
```cpp
public:
void SetJustification(
	ColumnAttachmentJustification justification
)
```
```fsharp
member SetJustification :
        justification : ColumnAttachmentJustification -> unit
```

#### Parameters

justification ColumnAttachmentJustification

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

ColumnAttachment Class

Autodesk.Revit.DB Namespace